In [1]:
import pandas as pd

In [11]:
trip_df = pd.read_csv('data/world_cities.csv', index_col=0)
trip_df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

In [4]:
trip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           249 non-null    int64
 1   City / Urban area    249 non-null    object
 2   Country              249 non-null    object
 3   Population           249 non-null    int64
 4   Land area (in sqKm)  249 non-null    int64
dtypes: int64(3), object(2)
memory usage: 9.9+ KB

In [5]:
trip_df['City / Urban area'].value_counts()

Buenos Aires            1
Bridgeport//Stamford    1
San Diego               1
Baltimore               1
Cincinnati              1
                       ..
Osaka/Kobe/Kyoto        1
Fukuoka                 1
Sapporo                 1
Kuwait                  1
Harare                  1
Name: City / Urban area, Length: 249, dtype: int64

In [6]:
trip_df['Country'].value_counts()

USA            105
France          15
Brazil          10
Canada           9
Germany          8
              ...
Israel           1
Kuwait           1
Malaysia         1
Netherlands      1
Zimbabwe         1
Name: Country, Length: 61, dtype: int64

In [7]:
trip_df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [8]:
trip_df['City / Urban area'].describe()

count              249
unique             249
top       Buenos Aires
freq                 1
Name: City / Urban area, dtype: object

In [12]:
trip_df.columns

Index(['City / Urban area', 'Country', 'Population', 'Land area (in sqKm)'], dtype='object')

In [21]:
trip_df[(trip_df['Population']) / (trip_df['Land area (in sqKm)']) > 10000].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 32 to 129
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   City / Urban area    19 non-null     object
 1   Country              19 non-null     object
 2   Population           19 non-null     int64
 3   Land area (in sqKm)  19 non-null     int64
 4   Mil                  19 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 912.0+ bytes

In [19]:
trip_df['Mil'] = (trip_df['Population']) / (trip_df['Land area (in sqKm)'])

In [22]:
trip_df.sort_values(by='Mil', ascending=False)

    City / Urban area   Country  Population  Land area (in sqKm)           Mil
75             Mumbai     India    14350000                  484  29648.760331
74            Kolkata     India    12700000                  531  23917.137476
101           Karachi  Pakistan     9800000                  518  18918.918919
99              Lagos   Nigeria    13400000                  738  18157.181572
34           Shenzhen     China     8000000                  466  17167.381974
..                ...       ...         ...                  ...           ...
195       Chattanooga       USA      344000                  751    458.055925
224         Asheville       USA      222000                  536    414.179104
57                Pau    France      181000                  450    402.222222
221           Hickory       USA      188000                  546    344.322344
197   Barnstable Town       USA      244000                  741    329.284750

[249 rows x 5 columns]

In [30]:
trip_df['Country'].value_counts()[trip_df['Country'].value_counts() >= 4]

USA             105
France           15
Brazil           10
Canada            9
Germany           8
Australia         6
China             6
India             6
South Africa      6
UK                5
Japan             5
Italy             4
Name: Country, dtype: int64